local datas = {
	[1] = {
		Id = 1,
		string = "波波利",
	},
	[2] = {
		Id = 2,
		string = "波利",
	},
	[3] = {
		Id = 3,
		string = "大野猪",
	},
	[4] = {
		Id = 4,
		string = "黑石怪",
	},
	[5] = {
		Id = 5,
		string = "灰铁石魔",
	},
	[6] = {
		Id = 6,
		string = "马蜂",
	},
	[7] = {
		Id = 7,
		string = "蘑菇",
	},
	[8] = {
		Id = 8,
		string = "熔岩巨魔",
	},
	[143] = {
		Id = 143,
		string = "手链",
	},
	[144] = {
		Id = 144,
		string = "丝带",
	},
	[145] = {
		Id = 145,
		string = "胸针",
	},
	[146] = {
		Id = 146,
		string = "细碎",
	},
	[147] = {
		Id = 147,
		string = "大块",
	},
	[148] = {
		Id = 148,
		string = "完整",
	},
	[149] = {
		Id = 149,
		string = "精致",
	},
	[151] = {
		Id = 151,
		string = "无瑕",
	},
	[152] = {
		Id = 152,
		string = "极品",
	},
	[153] = {
		Id = 153,
		string = "至尊",
	},
	[154] = {
		Id = 154,
		string = "铁锭",
	},
	[155] = {
		Id = 155,
		string = "兽皮",
	},
	[156] = {
		Id = 156,
		string = "毛料",
	},
	[157] = {
		Id = 157,
		string = "晶石",
	},
	[158] = {
		Id = 158,
		string = "坚固蓝宝石",
	},
	[159] = {
		Id = 159,
		string = "轻巧蓝水晶",
	},
	[161] = {
		Id = 161,
		string = "狂热红宝石",
	},
	[162] = {
		Id = 162,
		string = "致命红水晶",
	},
	[163] = {
		Id = 163,
		string = "毁灭黄宝石",
	},
	[164] = {
		Id = 164,
		string = "精准黄水晶",
	},
	[165] = {
		Id = 165,
		string = "隐秘绿宝石",
	},
	[166] = {
		Id = 166,
		string = "刚硬绿水晶",
	},
	[30000] = {
		Id = 30000,
		string = "wizard_bullet1",
	},
	[30001] = {
		Id = 30001,
		string = "wizard_bullet2",
	},
	[30002] = {
		Id = 30002,
		string = "wizard_bullet3",
	},
	[41111] = {
		Id = 41111,
		string = "Icon/10101.png",
	},
	[41112] = {
		Id = 41112,
		string = "Icon/10102.png",
	},
	[41113] = {
		Id = 41113,
		string = "Icon/10103.png",
	},
	[41114] = {
		Id = 41114,
		string = "Icon/10104.png",
	},
	[41115] = {
		Id = 41115,
		string = "Icon/10105.png",
	},
	[41116] = {
		Id = 41116,
		string = "Icon/10106.png",
	},
	[41117] = {
		Id = 41117,
		string = "Icon/10201.png",
	},
	[41118] = {
		Id = 41118,
		string = "Icon/10202.png",
	},
	[41119] = {
		Id = 41119,
		string = "Icon/10203.png",
	},
	[41121] = {
		Id = 41121,
		string = "Icon/10204.png",
	},
	[41122] = {
		Id = 41122,
		string = "Icon/10205.png",
	},
	[41123] = {
		Id = 41123,
		string = "Icon/10206.png",
	},
	[41124] = {
		Id = 41124,
		string = "Icon/10301.png",
	},
	[41125] = {
		Id = 41125,
		string = "Icon/10302.png",
	},
	[41126] = {
		Id = 41126,
		string = "Icon/10303.png",
	},
	[41127] = {
		Id = 41127,
		string = "Icon/10304.png",
	},
	[41128] = {
		Id = 41128,
		string = "Icon/10305.png",
	},
	[41129] = {
		Id = 41129,
		string = "Icon/10306.png",
	},
	[41131] = {
		Id = 41131,
		string = "Icon/10401.png",
	},
	[41132] = {
		Id = 41132,
		string = "Icon/10402.png",
	},
	[41133] = {
		Id = 41133,
		string = "Icon/10403.png",
	},
	[41134] = {
		Id = 41134,
		string = "Icon/10404.png",
	},
	[41135] = {
		Id = 41135,
		string = "Icon/10405.png",
	},
	[41136] = {
		Id = 41136,
		string = "Icon/10406.png",
	},
	[41137] = {
		Id = 41137,
		string = "Icon/10501.png",
	},
	[41138] = {
		Id = 41138,
		string = "Icon/10502.png",
	},
	[41139] = {
		Id = 41139,
		string = "Icon/10503.png",
	},
	[41141] = {
		Id = 41141,
		string = "Icon/10504.png",
	},
	[41142] = {
		Id = 41142,
		string = "Icon/10505.png",
	},
	[41143] = {
		Id = 41143,
		string = "Icon/10506.png",
	},
	[41144] = {
		Id = 41144,
		string = "Icon/10601.png",
	},
	[41145] = {
		Id = 41145,
		string = "Icon/10602.png",
	},
	[41146] = {
		Id = 41146,
		string = "Icon/10603.png",
	},
	[41147] = {
		Id = 41147,
		string = "Icon/10604.png",
	},
	[41148] = {
		Id = 41148,
		string = "Icon/10605.png",
	},
	[41149] = {
		Id = 41149,
		string = "Icon/10606.png",
	},
	[41151] = {
		Id = 41151,
		string = "Icon/10701.png",
	},
	[41152] = {
		Id = 41152,
		string = "Icon/10702.png",
	},
	[41153] = {
		Id = 41153,
		string = "Icon/10703.png",
	},
	[41154] = {
		Id = 41154,
		string = "Icon/10704.png",
	},
	[41155] = {
		Id = 41155,
		string = "Icon/10705.png",
	},
	[41156] = {
		Id = 41156,
		string = "Icon/10706.png",
	},
	[41157] = {
		Id = 41157,
		string = "Icon/10801.png",
	},
	[41158] = {
		Id = 41158,
		string = "Icon/10802.png",
	},
	[41159] = {
		Id = 41159,
		string = "Icon/10803.png",
	},
	[41161] = {
		Id = 41161,
		string = "Icon/10804.png",
	},
	[41162] = {
		Id = 41162,
		string = "Icon/10805.png",
	},
	[41163] = {
		Id = 41163,
		string = "Icon/10806.png",
	},
	[41164] = {
		Id = 41164,
		string = "Icon/20101.png",
	},
	[41165] = {
		Id = 41165,
		string = "Icon/20102.png",
	},
	[41166] = {
		Id = 41166,
		string = "Icon/20103.png",
	},
	[41167] = {
		Id = 41167,
		string = "Icon/20104.png",
	},
	[41168] = {
		Id = 41168,
		string = "Icon/20105.png",
	},
	[41169] = {
		Id = 41169,
		string = "Icon/20106.png",
	},
	[41171] = {
		Id = 41171,
		string = "Icon/20201.png",
	},
	[41172] = {
		Id = 41172,
		string = "Icon/20202.png",
	},
	[41173] = {
		Id = 41173,
		string = "Icon/20203.png",
	},
	[41174] = {
		Id = 41174,
		string = "Icon/20204.png",
	},
	[41175] = {
		Id = 41175,
		string = "Icon/20205.png",
	},
	[41176] = {
		Id = 41176,
		string = "Icon/20206.png",
	},
	[41177] = {
		Id = 41177,
		string = "Icon/20301.png",
	},
	[41178] = {
		Id = 41178,
		string = "Icon/20302.png",
	},
	[41179] = {
		Id = 41179,
		string = "Icon/20303.png",
	},
	[41181] = {
		Id = 41181,
		string = "Icon/20304.png",
	},
	[41182] = {
		Id = 41182,
		string = "Icon/20305.png",
	},
	[41183] = {
		Id = 41183,
		string = "Icon/20306.png",
	},
	[41184] = {
		Id = 41184,
		string = "Icon/20401.png",
	},
	[41185] = {
		Id = 41185,
		string = "Icon/20402.png",
	},
	[41186] = {
		Id = 41186,
		string = "Icon/20403.png",
	},
	[41187] = {
		Id = 41187,
		string = "Icon/20404.png",
	},
	[41188] = {
		Id = 41188,
		string = "Icon/20405.png",
	},
	[41189] = {
		Id = 41189,
		string = "Icon/20406.png",
	},
	[41191] = {
		Id = 41191,
		string = "Icon/20501.png",
	},
	[41192] = {
		Id = 41192,
		string = "Icon/20502.png",
	},
	[41193] = {
		Id = 41193,
		string = "Icon/20503.png",
	},
	[41194] = {
		Id = 41194,
		string = "Icon/20504.png",
	},
	[41195] = {
		Id = 41195,
		string = "Icon/20505.png",
	},
	[41196] = {
		Id = 41196,
		string = "Icon/20506.png",
	},
	[41197] = {
		Id = 41197,
		string = "Icon/20601.png",
	},
	[41198] = {
		Id = 41198,
		string = "Icon/20602.png",
	},
	[41199] = {
		Id = 41199,
		string = "Icon/20603.png",
	},
	[41211] = {
		Id = 41211,
		string = "Icon/20604.png",
	},
	[41212] = {
		Id = 41212,
		string = "Icon/20605.png",
	},
	[41213] = {
		Id = 41213,
		string = "Icon/20606.png",
	},
	[41214] = {
		Id = 41214,
		string = "Icon/20701.png",
	},
	[41215] = {
		Id = 41215,
		string = "Icon/20702.png",
	},
	[41216] = {
		Id = 41216,
		string = "Icon/20703.png",
	},
	[41217] = {
		Id = 41217,
		string = "Icon/20704.png",
	},
	[41218] = {
		Id = 41218,
		string = "Icon/20705.png",
	},
	[41219] = {
		Id = 41219,
		string = "Icon/20706.png",
	},
	[41221] = {
		Id = 41221,
		string = "Icon/20801.png",
	},
	[41222] = {
		Id = 41222,
		string = "Icon/20802.png",
	},
	[41223] = {
		Id = 41223,
		string = "Icon/20803.png",
	},
	[41224] = {
		Id = 41224,
		string = "Icon/20804.png",
	},
	[41225] = {
		Id = 41225,
		string = "Icon/20805.png",
	},
	[41226] = {
		Id = 41226,
		string = "Icon/20806.png",
	},
	[41227] = {
		Id = 41227,
		string = "Icon/30101.png",
	},
	[41228] = {
		Id = 41228,
		string = "Icon/30102.png",
	},
	[41229] = {
		Id = 41229,
		string = "Icon/30103.png",
	},
	[41231] = {
		Id = 41231,
		string = "Icon/30104.png",
	},
	[41232] = {
		Id = 41232,
		string = "Icon/30105.png",
	},
	[41233] = {
		Id = 41233,
		string = "Icon/30106.png",
	},
	[41234] = {
		Id = 41234,
		string = "Icon/30201.png",
	},
	[41235] = {
		Id = 41235,
		string = "Icon/30202.png",
	},
	[41236] = {
		Id = 41236,
		string = "Icon/30203.png",
	},
	[41237] = {
		Id = 41237,
		string = "Icon/30204.png",
	},
	[41238] = {
		Id = 41238,
		string = "Icon/30205.png",
	},
	[41239] = {
		Id = 41239,
		string = "Icon/30206.png",
	},
	[41241] = {
		Id = 41241,
		string = "Icon/30301.png",
	},
	[41242] = {
		Id = 41242,
		string = "Icon/30302.png",
	},
	[41243] = {
		Id = 41243,
		string = "Icon/30303.png",
	},
	[41244] = {
		Id = 41244,
		string = "Icon/30304.png",
	},
	[41245] = {
		Id = 41245,
		string = "Icon/30305.png",
	},
	[41246] = {
		Id = 41246,
		string = "Icon/30306.png",
	},
	[41247] = {
		Id = 41247,
		string = "Icon/30401.png",
	},
	[41248] = {
		Id = 41248,
		string = "Icon/30402.png",
	},
	[41249] = {
		Id = 41249,
		string = "Icon/30403.png",
	},
	[41251] = {
		Id = 41251,
		string = "Icon/30404.png",
	},
	[41252] = {
		Id = 41252,
		string = "Icon/30405.png",
	},
	[41253] = {
		Id = 41253,
		string = "Icon/30406.png",
	},
	[41254] = {
		Id = 41254,
		string = "Icon/30501.png",
	},
	[41255] = {
		Id = 41255,
		string = "Icon/30502.png",
	},
	[41256] = {
		Id = 41256,
		string = "Icon/30503.png",
	},
	[41257] = {
		Id = 41257,
		string = "Icon/30504.png",
	},
	[41258] = {
		Id = 41258,
		string = "Icon/30505.png",
	},
	[41259] = {
		Id = 41259,
		string = "Icon/30506.png",
	},
	[41261] = {
		Id = 41261,
		string = "Icon/30601.png",
	},
	[41262] = {
		Id = 41262,
		string = "Icon/30602.png",
	},
	[41263] = {
		Id = 41263,
		string = "Icon/30603.png",
	},
	[41264] = {
		Id = 41264,
		string = "Icon/30604.png",
	},
	[41265] = {
		Id = 41265,
		string = "Icon/30605.png",
	},
	[41266] = {
		Id = 41266,
		string = "Icon/30606.png",
	},
	[41267] = {
		Id = 41267,
		string = "Icon/30701.png",
	},
	[41268] = {
		Id = 41268,
		string = "Icon/30702.png",
	},
	[41269] = {
		Id = 41269,
		string = "Icon/30703.png",
	},
	[41271] = {
		Id = 41271,
		string = "Icon/30704.png",
	},
	[41272] = {
		Id = 41272,
		string = "Icon/30705.png",
	},
	[41273] = {
		Id = 41273,
		string = "Icon/30706.png",
	},
	[41274] = {
		Id = 41274,
		string = "Icon/30801.png",
	},
	[41275] = {
		Id = 41275,
		string = "Icon/30802.png",
	},
	[41276] = {
		Id = 41276,
		string = "Icon/30803.png",
	},
	[41277] = {
		Id = 41277,
		string = "Icon/30804.png",
	},
	[41278] = {
		Id = 41278,
		string = "Icon/30805.png",
	},
	[41279] = {
		Id = 41279,
		string = "Icon/30806.png",
	},
	[41281] = {
		Id = 41281,
		string = "Icon/40101.png",
	},
	[41282] = {
		Id = 41282,
		string = "Icon/40102.png",
	},
	[41283] = {
		Id = 41283,
		string = "Icon/40103.png",
	},
	[41284] = {
		Id = 41284,
		string = "Icon/40104.png",
	},
	[41285] = {
		Id = 41285,
		string = "Icon/40105.png",
	},
	[41286] = {
		Id = 41286,
		string = "Icon/40106.png",
	},
	[41287] = {
		Id = 41287,
		string = "Icon/40201.png",
	},
	[41288] = {
		Id = 41288,
		string = "Icon/40202.png",
	},
	[41289] = {
		Id = 41289,
		string = "Icon/40203.png",
	},
	[41291] = {
		Id = 41291,
		string = "Icon/40204.png",
	},
	[41292] = {
		Id = 41292,
		string = "Icon/40205.png",
	},
	[41293] = {
		Id = 41293,
		string = "Icon/40206.png",
	},
	[41294] = {
		Id = 41294,
		string = "Icon/40301.png",
	},
	[41295] = {
		Id = 41295,
		string = "Icon/40302.png",
	},
	[41296] = {
		Id = 41296,
		string = "Icon/40303.png",
	},
	[41297] = {
		Id = 41297,
		string = "Icon/40304.png",
	},
	[41298] = {
		Id = 41298,
		string = "Icon/40305.png",
	},
	[41299] = {
		Id = 41299,
		string = "Icon/40306.png",
	},
	[41311] = {
		Id = 41311,
		string = "Icon/40401.png",
	},
	[41312] = {
		Id = 41312,
		string = "Icon/40402.png",
	},
	[41313] = {
		Id = 41313,
		string = "Icon/40403.png",
	},
	[41314] = {
		Id = 41314,
		string = "Icon/40404.png",
	},
	[41315] = {
		Id = 41315,
		string = "Icon/40405.png",
	},
	[41316] = {
		Id = 41316,
		string = "Icon/40406.png",
	},
	[41317] = {
		Id = 41317,
		string = "Icon/40501.png",
	},
	[41318] = {
		Id = 41318,
		string = "Icon/40502.png",
	},
	[41319] = {
		Id = 41319,
		string = "Icon/40503.png",
	},
	[41321] = {
		Id = 41321,
		string = "Icon/40504.png",
	},
	[41322] = {
		Id = 41322,
		string = "Icon/40505.png",
	},
	[41323] = {
		Id = 41323,
		string = "Icon/40506.png",
	},
	[41324] = {
		Id = 41324,
		string = "Icon/40601.png",
	},
	[41325] = {
		Id = 41325,
		string = "Icon/40602.png",
	},
	[41326] = {
		Id = 41326,
		string = "Icon/40603.png",
	},
	[41327] = {
		Id = 41327,
		string = "Icon/40604.png",
	},
	[41328] = {
		Id = 41328,
		string = "Icon/40605.png",
	},
	[41329] = {
		Id = 41329,
		string = "Icon/40606.png",
	},
	[41331] = {
		Id = 41331,
		string = "Icon/40701.png",
	},
	[41332] = {
		Id = 41332,
		string = "Icon/40702.png",
	},
	[41333] = {
		Id = 41333,
		string = "Icon/40703.png",
	},
	[41334] = {
		Id = 41334,
		string = "Icon/40704.png",
	},
	[41335] = {
		Id = 41335,
		string = "Icon/40705.png",
	},
	[41336] = {
		Id = 41336,
		string = "Icon/40706.png",
	},
	[41337] = {
		Id = 41337,
		string = "Icon/40801.png",
	},
	[41338] = {
		Id = 41338,
		string = "Icon/40802.png",
	},
	[41339] = {
		Id = 41339,
		string = "Icon/40803.png",
	},
	[41341] = {
		Id = 41341,
		string = "Icon/40804.png",
	},
	[41342] = {
		Id = 41342,
		string = "Icon/40805.png",
	},
	[41343] = {
		Id = 41343,
		string = "Icon/40806.png",
	},
	[21111] = {
		Id = 21111,
		string = "monster_1002",
	},
	[21112] = {
		Id = 21112,
		string = "monster_1006",
	},
	[21113] = {
		Id = 21113,
		string = "monster_1007",
	},
	[21114] = {
		Id = 21114,
		string = "monster_1009",
	},
	[21115] = {
		Id = 21115,
		string = "monster_1014",
	},
	[21116] = {
		Id = 21116,
		string = "monster_1017",
	},
	[21117] = {
		Id = 21117,
		string = "monster_1019",
	},
	[21118] = {
		Id = 21118,
		string = "monster_1021",
	},
	[21119] = {
		Id = 21119,
		string = "monster_1026",
	},
	[21121] = {
		Id = 21121,
		string = "monster_1027",
	},
	[21122] = {
		Id = 21122,
		string = "monster_1030",
	},
	[31111] = {
		Id = 31111,
		string = "Icon/monster/u_1.png",
	},
	[31112] = {
		Id = 31112,
		string = "Icon/monster/u_12.png",
	},
	[31113] = {
		Id = 31113,
		string = "Icon/monster/u_14.png",
	},
	[31114] = {
		Id = 31114,
		string = "Icon/monster/u_15.png",
	},
	[31115] = {
		Id = 31115,
		string = "Icon/monster/u_16.png",
	},
	[31116] = {
		Id = 31116,
		string = "Icon/monster/u_7.png",
	},
	[70001] = {
		Id = 70001,
		string = "Card/monster_1019_kapai.ccbi",
	},
	[70002] = {
		Id = 70002,
		string = "Card/monster_1022_kapai.ccbi",
	},
	[70003] = {
		Id = 70003,
		string = "Card/monster_1038_kapai.ccbi",
	},
	[51111] = {
		Id = 51111,
		string = "Trap/trap_1111_1.ccbi",
	},
	[51112] = {
		Id = 51112,
		string = "Trap/trap_1112_1.ccbi",
	},
	[51113] = {
		Id = 51113,
		string = "Trap/trap_1112_2.ccbi",
	},
	[51114] = {
		Id = 51114,
		string = "Trap/trap_1113_1.ccbi",
	},
	[51115] = {
		Id = 51115,
		string = "Trap/trap_1113_2.ccbi",
	},
	[51116] = {
		Id = 51116,
		string = "Trap/trap_1113_3.ccbi",
	},
	[51117] = {
		Id = 51117,
		string = "Trap/trap_1113_4.ccbi",
	},
	[51118] = {
		Id = 51118,
		string = "Trap/trap_1115_1.ccbi",
	},
	[51119] = {
		Id = 51119,
		string = "Trap/trap_1115_2.ccbi",
	},
	[51121] = {
		Id = 51121,
		string = "Trap/trap_1115_3.ccbi",
	},
	[51122] = {
		Id = 51122,
		string = "Trap/trap_1114_1.ccbi",
	},
	[51123] = {
		Id = 51123,
		string = "Trap/trap_1114_2.ccbi",
	},
	[51124] = {
		Id = 51124,
		string = "Trap/trap_1114_3.ccbi",
	},
	[20000011] = {
		Id = 20000011,
		string = "年轻的勇士，感谢您不顾危险响应国王的号召\n前来参加远征军，我们给您准备了一份礼物，\n请您去佩娅娜那领取。",
	},
	[10000021] = {
		Id = 10000021,
		string = "真是勇敢的骚年~只要加入远征军，每个人都\n能领取一只属于自己的魔灵哦~",
	},
	[20000031] = {
		Id = 20000031,
		string = "干的不错！怎么样？体会到魔灵的强大了么，\n哦呵呵呵~~现在你去找凯瑟琳，她有任务给\n你。",
	},
	[10000041] = {
		Id = 10000041,
		string = "在日光林地深处，盘踞着一只狡猾的怪物，我\n们曾几次讨伐它，都被它逃走了。",
	},
	[20000051] = {
		Id = 20000051,
		string = "很好，你已经初步证明了你的实力，我可以放\n心交给你更为重要的任务了。现在你去格雷托\n那报道，他会告诉你怎么做。",
	},
	[10000061] = {
		Id = 10000061,
		string = "看来凯瑟琳又给我带来了一位好帮手，最近来\n王城的冒险者越来越少了。",
	},
	[20000071] = {
		Id = 20000071,
		string = "原来如此，看来那个家伙又开始不安分了，帮\n我去向凯瑟琳汇报情况吧。",
	},
	[10000081] = {
		Id = 10000081,
		string = "看来你干的不错，原来又是那个家伙，这次一\n定要让它好看！",
	},
	[20000091] = {
		Id = 20000091,
		string = "你做的很好，这回芬特应该会安静一段时间，\n你去趟金妮那，她有点小麻烦。",
	},
	[10000101] = {
		Id = 10000101,
		string = "阿拉啦，盼星星盼月亮终于把你盼来了，看来\n晚上终于能睡个安稳觉了。",
	},
	[20000111] = {
		Id = 20000111,
		string = "那是什么声音？情况有点不妙，这已经不是我\n能处理的问题了，你得去找芙兰问问。",
	},
	[10000121] = {
		Id = 10000121,
		string = "你好孩子，我是精灵芙兰，也是这个城市的先\n知，你找我有什么事么？",
	},
	[20000131] = {
		Id = 20000131,
		string = "真是让人放心的孩子，做的很好，凯瑟琳最近\n常常向我抱怨，你去帮帮她行么？",
	},
	[10000141] = {
		Id = 10000141,
		string = "冒险者，我这有一项紧急军情，我们有一队人\n被困在了远古之地-迈诺斯雪山，我需要你去\n营救他们！",
	},
	[20000151] = {
		Id = 20000151,
		string = "没找到他们么？冒险者，你去找到先知小姐，\n我们需要她的占卜为我们指引方向。",
	},
	[10000161] = {
		Id = 10000161,
		string = "啊咧咧，你来找我有什么事情么，冒险者？",
	},
	[20000171] = {
		Id = 20000171,
		string = "干的漂亮！你救回了他们，我会安顿好他们的\n，卡米拉现在需要你的帮忙。",
	},
	[10000181] = {
		Id = 10000181,
		string = "真是烦恼，有谁能来帮帮我，芙兰总是那么忙\n，我都不好意思让她帮忙。",
	},
	[20000191] = {
		Id = 20000191,
		string = "这个巨大的影子是谁？我不知道什么情况，要\n不你去问问见多识广的格雷托吧。",
	},
	[10000201] = {
		Id = 10000201,
		string = "格鲁瓦高原并没有非常强大的怪物，你可以去\n尝试去探查一下，说不定能发现那个巨大的怪\n物。",
	},
	[20000211] = {
		Id = 20000211,
		string = "我查过了，它叫卡卡诺克，原先只是一个普通\n的泰格拉战士，因为控制了一个食人魔，成为\n了泰格拉部落的老大，它那好东西不少吧？",
	},
	[10000221] = {
		Id = 10000221,
		string = "我正在试验一种新的锻造方法，需要一些材料\n，你能帮我找一些么？",
	},
	[20000231] = {
		Id = 20000231,
		string = "不错不错，这样一来，我们远征军的实力又能\n大大增强了，你想先试试么？",
	},
	[10000241] = {
		Id = 10000241,
		string = "什么？你看到了两只巨大的虫子在湖中间的小\n岛上？你刚才怎么不早说！",
	},
	[20000251] = {
		Id = 20000251,
		string = "干的漂亮！这是给你的回报，我这没你啥事了\n，我要开始做研究了。",
	},
	[10000261] = {
		Id = 10000261,
		string = "这位冒险者，能帮下我这个可爱的小女孩么？",
	},
	[20000271] = {
		Id = 20000271,
		string = "探索商路的事情先放放，我们需要先问问凯瑟\n琳关于图勒姆戈壁的情报了，这该死的大虫子\n是怎么出现的？",
	},
	[10000281] = {
		Id = 10000281,
		string = "戈壁里出现了一只大虫子？我记得原先并没有\n啊。",
	},
	[20000291] = {
		Id = 20000291,
		string = "你的实力让我惊讶！你可以去向金妮报告这件\n事了。",
	},
	[10000301] = {
		Id = 10000301,
		string = "哈哈，我果然没看错你，现在我们可以继续我\n们的计划了，向图勒姆沙海前进！",
	},
	[20000311] = {
		Id = 20000311,
		string = "做的好！商路开拓计划暂时就到这里，芙兰小\n姐要向我借你一段时间，快去吧~",
	},
	[10000321] = {
		Id = 10000321,
		string = "真是不好意思，又要麻烦你了，我收到一份情\n报，图勒姆沙海深处发生了一些变化。",
	},
	[20000331] = {
		Id = 20000331,
		string = "已我的能力，看不清这其中的奥秘，你去向凯\n瑟琳汇报这个情况吧，她应该知道些什么。",
	},
	[10000341] = {
		Id = 10000341,
		string = "你来的正好，最新情报，沙卡拉金字塔重现人\n间，亚图姆又回来了。",
	},
	[20000351] = {
		Id = 20000351,
		string = "那个黄金打造的棺材把门堵住了，你去芙兰小\n姐那寻求帮助，看看有什么办法没有。",
	},
	[10000361] = {
		Id = 10000361,
		string = "我已经大致知道情况了，那是亚图姆的神圣王\n座，除非亚图姆愿意，不然没人能打破它，这\n之中一定有阴谋。",
	},
	[20000371] = {
		Id = 20000371,
		string = "做的好！我已经不能帮助你太多了，借助神明\n的力量让我及其虚弱，你现在去找凯瑟琳商量\n以后的对策。",
	},
	[10000381] = {
		Id = 10000381,
		string = "你居然破坏了神圣王座，以前是我小看你了，\n你是个真正的冒险者。",
	},
	[20000391] = {
		Id = 20000391,
		string = "亚图姆在进行某种仪式，它想干什么？我不清\n楚，你需要去问问芙兰。",
	},
	[10000401] = {
		Id = 10000401,
		string = "仪式？不好！亚图姆想要唤醒悔罪之座-奥西\n里斯！",
	},
	[20000411] = {
		Id = 20000411,
		string = "我们挫败了亚图姆的阴谋，并且再次封印了奥\n西里斯。",
	},
	[20000012] = {
		Id = 20000012,
		string = "",
	},
	[10000022] = {
		Id = 10000022,
		string = "魔灵？那是什么？能吃么>_<",
	},
	[20000032] = {
		Id = 20000032,
		string = "",
	},
	[10000042] = {
		Id = 10000042,
		string = "啊咧？以你们的实力还捉不到它么，有点棘手\n啊，能详细介绍下么？",
	},
	[20000052] = {
		Id = 20000052,
		string = "",
	},
	[10000062] = {
		Id = 10000062,
		string = "你好，格雷托先生，我能帮到你什么吗？",
	},
	[20000072] = {
		Id = 20000072,
		string = "",
	},
	[10000082] = {
		Id = 10000082,
		string = "额，请问你们说的那个家伙指的是谁？",
	},
	[20000092] = {
		Id = 20000092,
		string = "",
	},
	[10000102] = {
		Id = 10000102,
		string = "听凯瑟琳小姐说这边有点小麻烦，我过来瞧瞧\n。",
	},
	[20000112] = {
		Id = 20000112,
		string = "",
	},
	[10000122] = {
		Id = 10000122,
		string = "科罗特矿洞深处传来巨大的声响，金妮让我找\n你问问情况。",
	},
	[20000132] = {
		Id = 20000132,
		string = "",
	},
	[10000142] = {
		Id = 10000142,
		string = "是，保证完成任务！情况紧急，我这就出发。",
	},
	[20000152] = {
		Id = 20000152,
		string = "",
	},
	[10000162] = {
		Id = 10000162,
		string = "芙兰小姐，我们有一队人被困在迈诺斯雪山，\n我们需要您指引方向。",
	},
	[20000172] = {
		Id = 20000172,
		string = "",
	},
	[10000182] = {
		Id = 10000182,
		string = "你好，卡米拉，凯瑟琳让我来帮你，你能和我\n说说么？",
	},
	[20000192] = {
		Id = 20000192,
		string = "",
	},
	[10000202] = {
		Id = 10000202,
		string = "但是，如果我真的发现它了怎么办？",
	},
	[20000212] = {
		Id = 20000212,
		string = "",
	},
	[10000222] = {
		Id = 10000222,
		string = "请问是什么材料？只要我能做到！",
	},
	[20000232] = {
		Id = 20000232,
		string = "",
	},
	[10000242] = {
		Id = 10000242,
		string = "是的，先生，我看到了一红一篮两只大虫子。",
	},
	[20000252] = {
		Id = 20000252,
		string = "",
	},
	[10000262] = {
		Id = 10000262,
		string = "额，金妮小姐不要这样，有什么事您就说好了\n~",
	},
	[20000272] = {
		Id = 20000272,
		string = "",
	},
	[10000282] = {
		Id = 10000282,
		string = "是的，凯瑟琳小姐，我感觉不对劲就先撤回来\n了",
	},
	[20000292] = {
		Id = 20000292,
		string = "",
	},
	[10000302] = {
		Id = 10000302,
		string = "等等，难道还要继续探索商路么？还有，为什\n么是我们？",
	},
	[20000312] = {
		Id = 20000312,
		string = "",
	},
	[10000322] = {
		Id = 10000322,
		string = "变化？我刚从沙海回来，我的皮肤都晒黑了~",
	},
	[20000332] = {
		Id = 20000332,
		string = "",
	},
	[10000342] = {
		Id = 10000342,
		string = "最新情报？我刚把龙给干掉，怎么又出事了？",
	},
	[20000352] = {
		Id = 20000352,
		string = "",
	},
	[10000362] = {
		Id = 10000362,
		string = "芙兰小姐，那我们应该怎么办？",
	},
	[20000372] = {
		Id = 20000372,
		string = "",
	},
	[10000382] = {
		Id = 10000382,
		string = "芙兰小姐力量透支严重，我们需要商议下以后\n的对策。",
	},
	[20000392] = {
		Id = 20000392,
		string = "",
	},
	[10000402] = {
		Id = 10000402,
		string = "悔罪之座？奥西里斯？到底是什么？",
	},
	[20000412] = {
		Id = 20000412,
		string = "",
	},
	[20000013] = {
		Id = 20000013,
		string = "",
	},
	[10000023] = {
		Id = 10000023,
		string = "哦呵呵~~还真是可爱呢，魔灵可是人类的好\n朋友，造物主的恩赐。去试试它的威力吧！",
	},
	[20000033] = {
		Id = 20000033,
		string = "",
	},
	[10000043] = {
		Id = 10000043,
		string = "它的名字叫做奥鲁夫，是一只野猪王，我们都\n称呼它为荆棘之爪，我们已经确切掌握它的行\n动，你的任务就是讨伐它！",
	},
	[20000053] = {
		Id = 20000053,
		string = "",
	},
	[10000063] = {
		Id = 10000063,
		string = "当然，月光之森最近越来越不太平了，我们的\n物资收集队伍损失惨重，我需要你去探查一下\n，顺便带回点物资。",
	},
	[20000073] = {
		Id = 20000073,
		string = "",
	},
	[10000083] = {
		Id = 10000083,
		string = "机木巨兽芬特，最近它越来越狂暴，让月光之\n森的魔物也开始狂暴起来，你的任务就是让它\n安分点。",
	},
	[20000093] = {
		Id = 20000093,
		string = "",
	},
	[10000103] = {
		Id = 10000103,
		string = "小麻烦？那些该死的矿工鼠造反了，我们这个\n月用来贸易的矿石份额还不够！你来的正好，\n帮我敲打敲打它们。",
	},
	[20000113] = {
		Id = 20000113,
		string = "",
	},
	[10000123] = {
		Id = 10000123,
		string = "看来矿洞的守护者戈伦从沉睡中苏醒了，应该\n是它压迫矿工鼠造反，你可以帮我解决它么？",
	},
	[20000133] = {
		Id = 20000133,
		string = "",
	},
	[10000143] = {
		Id = 10000143,
		string = "好的，千万做好准备再去，期待你的好消息！",
	},
	[20000153] = {
		Id = 20000153,
		string = "",
	},
	[10000163] = {
		Id = 10000163,
		string = "原来如此，稍等我片刻…他们被雪山之王-无\n情的艾布雷克捉住了，快去营救他们吧！",
	},
	[20000173] = {
		Id = 20000173,
		string = "",
	},
	[10000183] = {
		Id = 10000183,
		string = "啊，真是太好了~我有一批货物被偷了，据说\n是格鲁瓦高原的泰格拉部落干的，你能帮我去\n查下这批货物的下落么？",
	},
	[20000193] = {
		Id = 20000193,
		string = "",
	},
	[10000203] = {
		Id = 10000203,
		string = "哈哈，这还不简单，那就狠狠的教训它，揭穿\n它的真面目！",
	},
	[20000213] = {
		Id = 20000213,
		string = "",
	},
	[10000223] = {
		Id = 10000223,
		string = "就在坠星湖，生活着一些特殊的虫子，我需要\n你收集它们身上的晶体，去吧~我看好你哦！",
	},
	[20000233] = {
		Id = 20000233,
		string = "",
	},
	[10000243] = {
		Id = 10000243,
		string = "太好了，你能继续帮我走一趟么？我需要它们\n身上的晶体，这一定是大发现。",
	},
	[20000253] = {
		Id = 20000253,
		string = "",
	},
	[10000263] = {
		Id = 10000263,
		string = "恩恩，我想在图勒姆戈壁探索出一条新商路，\n你能帮我么？我给报酬哦~",
	},
	[20000273] = {
		Id = 20000273,
		string = "",
	},
	[10000283] = {
		Id = 10000283,
		string = "明智的选择，不过我现在需要你去试探一下这\n只大虫子的实力。",
	},
	[20000293] = {
		Id = 20000293,
		string = "",
	},
	[10000303] = {
		Id = 10000303,
		string = "嘿嘿，我的好处可没这么容易拿，快点去！",
	},
	[20000313] = {
		Id = 20000313,
		string = "",
	},
	[10000323] = {
		Id = 10000323,
		string = "所以我说麻烦你嘛~~沙海深处出现了一条龙\n，我需要你去证实这个情报。",
	},
	[20000333] = {
		Id = 20000333,
		string = "",
	},
	[10000343] = {
		Id = 10000343,
		string = "龙？那条龙只是法老王亚图姆制造的幻影，我\n现在需要你突入金字塔，找到亚图姆。",
	},
	[20000353] = {
		Id = 20000353,
		string = "",
	},
	[10000363] = {
		Id = 10000363,
		string = "我只能借助神明的力量削弱神圣王座的力量，\n其他的只能靠你了！",
	},
	[20000373] = {
		Id = 20000373,
		string = "",
	},
	[10000383] = {
		Id = 10000383,
		string = "我们现在还不知道亚图姆想做什么，我需要你\n去侦察一下。",
	},
	[20000393] = {
		Id = 20000393,
		string = "",
	},
	[10000403] = {
		Id = 10000403,
		string = "奥西里斯是上古魔神，悔罪之座是他的神明，\n被神明封印在阿图蒙特神殿，我需要你去破坏\n亚图姆的计划！",
	},
	[20000413] = {
		Id = 20000413,
		string = "",
	},
	[30000001] = {
		Id = 30000001,
		string = "我叫芙兰，我是个精灵。",
	},
	[30000002] = {
		Id = 30000002,
		string = "我这里有你想要的。",
	},
	[30000003] = {
		Id = 30000003,
		string = "我会教会你怎样驱使魔灵战斗。",
	},
	[30000004] = {
		Id = 30000004,
		string = "我是金妮，但不是奸商哦。",
	},
	[30000005] = {
		Id = 30000005,
		string = "一切材料和宝石都交给我吧！",
	},
	[30000006] = {
		Id = 30000006,
		string = "买票！买票！商务舱100一张。",
	},
	[30000007] = {
		Id = 30000007,
		string = "小心乘船哦，不过能遇到rose这样的女人乘船\n也心甘。",
	},
	[30000008] = {
		Id = 30000008,
		string = "只有经受最严酷考验的士兵才是好士兵。",
	},
	[30000009] = {
		Id = 30000009,
		string = "荣耀即吾命！",
	},
	[40000001] = {
		Id = 40000001,
		string = "国王号召王国的冒险者参加远征军，对于立志\n成为一个伟大冒险家的我来说，这个机会一定\n不能错过，我要前往王都参加远征军！",
	},
	[40000004] = {
		Id = 40000004,
		string = "呼，这一路的魔物还真多，王都近在眼前，远\n征军，我来了！",
	},
	[40000005] = {
		Id = 40000005,
		string = "魔灵能帮助主人一起战斗，每个伟大的冒险者\n都拥有非常强大的魔灵。",
	},
	[40000008] = {
		Id = 40000008,
		string = "现在你已经初步掌握了驱使魔灵战斗的方法，\n赶快回来，还有一堆事要做呢！",
	},
	[40000009] = {
		Id = 40000009,
		string = "日光林地深处魔物横行，还有神出鬼没的野猪\n王，前往要注意安全，现在出发吧。",
	},
	[40000010] = {
		Id = 40000010,
		string = "这次终于干掉它了，下一步我们要开始肃清王\n都周边的地域，保证物资的运输。",
	},
	[40000011] = {
		Id = 40000011,
		string = "月光森林的暴动一定有原因，现在你需要深入\n一点，探查到此次暴动的真正原因。",
	},
	[40000018] = {
		Id = 40000018,
		string = "差不多先到这里吧，我已经大致明白了什么情\n况。再深入会有危险，你先回来，做好充足的\n准备。",
	},
	[40000019] = {
		Id = 40000019,
		string = "芬特在月光森林生活了几百年，这里是它的地\n盘，我们一定要小心谨慎。",
	},
	[40000020] = {
		Id = 40000020,
		string = "就是这样，你的实力不错，在月光森林的芬特\n可是非常强大的，你还是击败了它。",
	},
	[40000021] = {
		Id = 40000021,
		string = "矿工鼠的胆子很小，如果没有人指使，肯定不\n会造反，我们去深处看看。",
	},
	[40000028] = {
		Id = 40000028,
		string = "你有没有听到不同寻常的声音？情况有点不妙\n，我们先回去从长计议！",
	},
	[40000029] = {
		Id = 40000029,
		string = "戈伦每次在沉睡苏醒后都会非常暴躁，我们只\n要击败它，让它再次陷入沉睡就可以了。",
	},
	[40000030] = {
		Id = 40000030,
		string = "很好，戈伦消耗了大量的能量，又会开始长时\n间的沉睡，对于我们来说，需要抓紧这段宝贵\n的时间开采矿石。",
	},
	[40000031] = {
		Id = 40000031,
		string = "雪山上最危险的不是雪山怪物，而是大自然的\n危险，虽说救人要紧，但是也要小心。",
	},
	[40000038] = {
		Id = 40000038,
		string = "前面就是无情的艾布雷克的地盘，在没有确定\n我们的人在它手上之前，我们先不去惊动它。",
	},
	[40000039] = {
		Id = 40000039,
		string = "既然确定人就在艾布雷克手里，我们不得不去\n挑战一下这位雪山之王的权威了，我们走！",
	},
	[40000040] = {
		Id = 40000040,
		string = "我们打败了它！赶快救了人就走，艾布雷克在\n雪山的恢复速度很快，不能等它恢复过来。",
	},
	[40000041] = {
		Id = 40000041,
		string = "泰格拉部落是格鲁瓦高原的土著，它们总是打\n劫商队和旅人，可以说是格鲁瓦高原的一大危\n害。",
	},
	[40000048] = {
		Id = 40000048,
		string = "嘘，不要出声！那边有个巨大的身影，在不确\n定是什么生物的前提下，我们先退回去，搞清\n楚了再来。",
	},
	[40000049] = {
		Id = 40000049,
		string = "虽说格鲁瓦高原并不危险，但是有不少遗留的\n机关陷阱，我们不能大意！",
	},
	[40000050] = {
		Id = 40000050,
		string = "呸，原来只是一个控制了食人魔的泰格拉，我\n还以为是谁！",
	},
	[40000051] = {
		Id = 40000051,
		string = "坠星湖的生态环境非常好，所以这里的虫子都\n很大只，并且还有一些进化成了魔物，我们不\n要轻易招惹它们。",
	},
	[40000058] = {
		Id = 40000058,
		string = "好了，这些晶体差不多够了，我们不必再冒险\n深入，先回去，我迫不及待要开始我的实验了\n。",
	},
	[40000059] = {
		Id = 40000059,
		string = "听好了，这次我们的目标是那两只大飞虫，所\n以中间不要恋战，我们冲过去！",
	},
	[40000060] = {
		Id = 40000060,
		string = "哈哈，真是稀世珍宝，有了这些，我的实验成\n功几率大增！走，我们回家。",
	},
	[40000061] = {
		Id = 40000061,
		string = "为了供应远征军的消耗，我们必须开辟更多的\n商路，我会给你相应的报酬的。",
	},
	[40000068] = {
		Id = 40000068,
		string = "不好，快走，前面出现了一只大虫子，我们先\n回王都，我需要查看下最新的情报。",
	},
	[40000069] = {
		Id = 40000069,
		string = "这次的任务只是试探，当然，如果那只大虫子\n的实力一般，我不介意你直接干掉它。",
	},
	[40000070] = {
		Id = 40000070,
		string = "干掉了！居然被你干掉了，我承认小看你了，\n这样一来，商路也就肃清了，我们回去吧！",
	},
	[40000071] = {
		Id = 40000071,
		string = "相对于图勒姆戈壁而言，图勒姆沙海更加危险\n和诡异，千万要小心！",
	},
	[40000078] = {
		Id = 40000078,
		string = "哈哈，图勒姆沙海也没有想象中那么危险么，\n大功告成，我们回去吧。",
	},
	[40000079] = {
		Id = 40000079,
		string = "那条龙出现的时机很微妙，有一股阴谋的味道\n，前进！",
	},
	[40000080] = {
		Id = 40000080,
		string = "啧，原来只是个幻影，这其中果然有阴谋，看\n来又有的忙了。",
	},
	[40000081] = {
		Id = 40000081,
		string = "沙卡拉金字塔是远古时期的人们建造起来用来\n封印某个强大的魔神，所以这处处透着诡异，\n你要小心行事。",
	},
	[40000088] = {
		Id = 40000088,
		string = "前面貌似被什么东西挡住了去路，我们先回去\n，对于这种超自然的情况，我不擅长。",
	},
	[40000089] = {
		Id = 40000089,
		string = "神圣王座的力量虽然被我削弱不少，但还是非\n常强大的，还有法老王在一边虎视眈眈，走错\n一步我们就交代在这里了。",
	},
	[40000090] = {
		Id = 40000090,
		string = "呼，总算突破了神圣王座的封锁，我们需要回\n王都休整一下，不然以现在的状态是不可能继\n续走下去的。",
	},
	[40000091] = {
		Id = 40000091,
		string = "阿图蒙特神殿作为一个封印魔神的地方，机关\n重重，小心！",
	},
	[40000098] = {
		Id = 40000098,
		string = "那是什么？貌似是刚绘制的魔法阵，我们先退\n回去，问清楚情报再来。",
	},
	[40000099] = {
		Id = 40000099,
		string = "亚图姆妄图唤醒奥西里斯，我们必须阻止它，\n此行只许成功不许失败。",
	},
	[40000100] = {
		Id = 40000100,
		string = "干的好！还好亚图姆的仪式只进行了一半，奥\n西里斯的力量只释放了一点点，不然我们都不\n能活着回去。",
	},
	[50000001] = {
		Id = 50000001,
		string = "有四个符文散落在附近，集齐它们才能找到通\n往最终宝藏的途径。",
	},
}

return datas